export const sliderMockData = [
  {
    id: 23,
    title: "건강챙기기",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "만보걷기 등",
  },
  {
    id: 23654,
    title: "음식",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "어쩌구",
  },
  {
    id: 23656,
    title: "자개개발",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "어쩌구",
  },
  {
    id: 23000,
    title: "여행/탐험",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "저쩌구",
  },
  {
    id: 234832904,
    title: "교류",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "샬라샬라",
  },
  {
    id: 2307438,
    title: "재미",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "밥내놔",
  },
  {
    id: 2302489373284,
    title: "랜덤",
    img_url:
      "https://health.chosun.com/site/data/img_dir/2023/07/17/2023071701753_0.jpg",
    content: "자고싶어요",
  },
];

export const aboutService = [
  {
    id: 435574,
    title: "서비스 목적",
    description:
      "#오챌완은... Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure repellendus officia non blanditiis earum. Nulla ullam mollitia enim provident optio ipsa dolor sunt quo nihil molestias animi illum, aut suscipit",
  },
  {
    id: 408774,
    title: "서비스 목적2",
    description:
      "#오챌완은... Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure repellendus officia non blanditiis earum. Nulla ullam mollitia enim provident optio ipsa dolor sunt quo nihil molestias animi illum, aut suscipit",
  },
];

export const termsOfService = [
  {
    id: "제1조 (목적)",
    title: "제1조 (목적)",
    description:
      " 본 약관은 ‘빅스텝(Big Step)’(이하 ’빅스텝’)이 제공하는 ‘오챌완’(이하 ‘서비스’)과 관련하여 빅스텝과 이용자의 권리, 의무, 책임사항, 기타 필요 사항을 규정함을 목적으로 합니다.",
  },
  {
    id: "제2조 (정의)",
    title: "제2조 (정의)",
    description: `본 약관에서 사용하는 용어의 정의는 다음과 같습니다. 
    이용자 : 빅스텝의 서비스에 접속하여 본 약관에 따라 빅스텝이 제공하는 서비스를 이용하는 회원 및 비회원을 말합니다."
    회원 : 빅스텝의 서비스에 접속하여 본 약관에 동의하고 개인정보를 제공한 자로서, 빅스텝과 이용계약을 체결하고 빅스텝이 제공하는 서비스를 이용하는 이용자를 말합니다.
    비회원 : 빅스텝의 서비스에 접속하여 서비스에 가입하지 않고 이 약관에 따라 이용계약을 체결하고 빅스텝이 제공하는 서비스를 이용하는 이용자를 말합니다.
    서비스 : 빅스텝이 제공하는 일일 챌린지 관련 서비스로서 구현되는 단말기(PC, TV, 휴대형단말기 등 각종 유무선 장치를 포함)와 상관없이 이용자가 이용할 수 있는 서비스 관련 웹(Web),앱(App) 등의 제반 서비스를 말합니다.
    아이디(ID) : 회원의 식별과 서비스 이용을 위하여 회원이 정하고 빅스텝이 승인하는 전자우편 주소를 말합니다.
    비밀번호 : 회원이 부여 받은 아이디와 일치되는 회원임을 확인하고 비밀보호를 위해 회원 자신이 정한 문자 또는 숫자의 조합을 의미합니다.
    게시물 : 빅스텝 또는 회원이 서비스를 이용하는 데 있어 온오프라인의 서비스상에 업로드 또는 다운로드되거나 표시되는 형태(동영상, 이미지, 텍스트, 음성, 부호, 문자 등)의 모든 창작물을 의미합니다.`,
  },
  {
    id: "제3조 (약관 외 준칙)",
    title: "제3조 (약관 외 준칙)",
    description: `본 약관에 명시되지 아니한 사항이나 해석에 대해서는 「정보통신망 이용촉진 및 정보보호 등에 관한 법률」, 「콘텐츠산업 진흥법」 등 관계법령 또는 상관례에 따릅니다.`,
  },
  {
    id: "제4조 (이용계약 체결)",
    title: "제4조 (이용계약 체결)",
    description: `
    이용계약은 회원이 되고자 하는 자(이하 ‘가입신청자’)가 약관의 내용에 동의하고 회원가입을 신청하면 빅스텝이 이러한 신청에 대해 승낙함으로써 체결됩니다.
    빅스텝은 가입신청자의 신청에 대하여 서비스 이용을 승낙함을 원칙으로 합니다. 다만, 빅스텝은 다음 각 호에 해당하는 신청에 대하여 승낙을 하지 않거나 사후에 계약을 해지할 수 있습니다.
    가입신청자가 본 약관에 의해 이전에 회원 자격을 상실한 적이 있는 경우, 단 빅스텝의 재가입 승낙을 얻은 경우에는 예외로 함
    타인의 명의를 이용한 경우
    동일인이 다수의 계정을 생성하려 한 경우
    14세 미만 아동이 가입을 신청하는 경우
    이용자의 귀책사유로 인하여 승인이 불가능 하거나 기타 규정한 제반사항을 위반하며 신청하는 경우
    관계 법령에 위배되거나 사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우
    기타 회원으로 등록하는 것이 빅스텝의 기술상 현저히 지장이 있다고 판단되는 경우 및 빅스텝의 합리적인 판단에 따라 필요하다고 인정되는 경우
    빅스텝은 회원에 대하여 「청소년보호법」 등에 따른 등급 및 연령 준수를 위해 이용제한이나 등급별 제한을 둘 수 있습니다.`,
  },
  {
    id: "제5호 (개인정보보호 의무)",
    title: "제5호 (개인정보보호 의무)",
    description: `
    빅스텝은 이용자의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련법 및 빅스텝의 개인정보처리방침이 적용됩니다.
    단, 회원의 귀책사유로 노출된 정보에 대해 빅스텝은 일체의 책임을 지지 않습니다.`,
  },
  {
    id: "제6호 (이용자에 대한 통지)",
    title: "제6호 (이용자에 대한 통지)",
    description: `빅스텝이 이용자에 대한 통지를 하는 경우 본 약관에 별도 규정이 없는 한 이용자가 빅스텝에 제출한 전자우편주소 등으로 할 수 있습니다.
    빅스텝은 불특정다수의 이용자에 대한 통지의 경우 서비스 내 게시함으로써 개별 통지에 갈음할 수 있습니다.`,
  },
  {
    id: "제7호 (빅스텝의 의무)",
    title: "제7호 (빅스텝의 의무)",
    description: `빅스텝은 관련법과 본 약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위해 최선을 다합니다. 다만, 천재지변 또는 부득이한 사유가 있는 경우 서비스 운영을 일시 정지할 수 있습니다.
빅스텝은 이용자로부터 제기된 의견이나 불만이 정당하다고 인정되는 경우에는 이를 처리하여야 합니다.`,
  },
  {
    id: "제8호 (이용자의 의무)",
    title: "제8호 (이용자의 의무)",
    description: `
    이용자는 본 약관의 규정, 관계법령, 이용안내 및 서비스와 관련한 공지사항, 빅스텝이 통지하는 사항 등을 준수하여야 하며, 기타 빅스텝의 업무에 방해되는 행위를 해서는 안됩니다. 약관 및 고지내용을 위반하거나 이행하지 아니하여 발생하는 손해에 대하여 책임을 부담합니다.
    이용자는 빅스텝이 서비스를 안전하게 제공할 수 있도록 빅스텝에 협조해야 하며, 빅스텝이 이용자의 본 약관 위반행위를 발견하여 소명을 요청할 경우 이용자는 빅스텝의 요청에 적극 응하여야 합니다.
    이용자는 다음 각 호의 행위를 하여서는 안됩니다.
    빅스텝이 제공하는 서비스 이용방법에 의하지 아니하고 비정상적인 방법으로 서비스를 이용하거나 시스템에 접근하는 행위
    빅스텝의 서비스 정보를 이용하여 얻은 정보를 사전 승낙 없이 복제 또는 유통시키거나 상업적으로 이용하는 행위
    빅스텝 또는 제3자의 저작권 등 기타 권리를 침해하는 행위
    영리를 목적으로 서비스를 이용하는 행위
    서비스와 관련된 설비의 오작동이나 정보 등 파괴 및 혼란을 유발시키는 행위
    빅스텝의 동의 없이 서비스 또는 이에 포함된 소프트웨어의 일부를 복사, 수정, 배포, 판매, 양도, 대여, 담보제공하거나 타인에게 그 이용을 허락하는 행위
    소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 서비스를 복제, 분해 또는 모방하거나 기타 변형하는 행위
    빅스텝 운영자 또는 제3자를 가장하거나 사칭하는 행위
    기타 현행 법령, 본 약관 및 빅스텝이 제공하는 서비스의 세부지침을 위반하는 행위 및 서비스의 정상적인 운영을 방해하는 행위
    빅스텝은 본 조의 금지행위를 하는 경우 서비스 이용을 정지하거나 서비스 이용계약을 임의로 해지할 수 있으며, 이 경우 발생하는 손해에 대한 책임은 이용자가 부담합니다. 빅스텝은 필요한 경우 이용자의 금지행위 사실을 관련 정부기관 또는 사법기관에 통지할 수 있습니다.`,
  },
  {
    id: "제9호 (서비스의 제공 등)",
    title: "제9호 (서비스의 제공 등)",
    description: `
    빅스텝은 다음과 같은 서비스를 제공합니다.
    챌린지 콘텐츠 제공 서비스
    챌린지 콘텐츠 아카이브 서비스
    기타 빅스텝이 추가 개발하거나 다른 회사와의 제휴를 통해 이용자에게 제공하는 일체의 서비스
    빅스텝은 서비스를 일정범위로 분할하여 각 범위 별로 이용가능시간을 별도로 지정할 수 있습니다.
    서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다. 다만, 서비스 시스템의 정기점검, 증설, 교체, 고장 등 운영상 상당한 이유가 있는 경우 서비스를 일시중단할 수 있습니다. 이 경우 빅스텝은 제7조에 정한 방법으로 이용자에게 통지합니다. 다만, 빅스텝이 사전에 통지할 수 없는 부득이한 사유가 있는 경우 사후에 통지할 수 있습니다.
    빅스텝은 상당한 이유가 있는 경우 운영상, 기술상의 필요에 따라 제공하고 있는 서비스의 전부 또는 일부를 변경할 수 있습니다.
    빅스텝은 제공되는 서비스의 일부 또는 전부를 회시ㅏ의 정책 및 운영의 필요상 수정, 중단, 변경할 수 있으며, 이에대한 관련법에 특별한 규정이 없는 한 이용자에게 별도의 보상을 하지 않습니다.
    `,
  },
  {
    id: "제10조 (정보의 제공 및 광고의 게재)",
    title: "제10조 (정보의 제공 및 광고의 게재)",
    description: `
빅스텝은 이용자가 서비스 중 필요하다고 인정되는 다양한 정보를 공지사항이나 전자우편의 방법으로 이용자에게 제공할 수 있습니다. 다만, 이용자는 관련법에 따른 거래관련 정보 및 고객문의 등에 대한 답변 등을 제외하고는 언제든지 전자우편에 대해서 수신 거절을 할 수 있습니다.
제1항의 정보를 전화 및 모사전송기기에 의하여 전송하려고 하는 경우에는 이용자의 사전 동의를 받아서 전송합니다. 다만, 이용자의 거래관련 정보 및 고객문의 등에 대한 회신에 있어서는 제외됩니다.
빅스텝은 서비스의 운영과 관련하여 서비스 화면에 광고를 게재할 수 있습니다.
빅스텝은 사전에 마케팅 정보 알림을 동의핞 이용자에게만 광고성 정보를 발송합니다.
이용자는 빅스텝이 제공하는 서비스와 관련하여 게시물 또는 기타 정보를 변겅, 수정, 제한하는 등의 조치를 취하지 않습니다.`,
  },
  {
    id: "제11조 (게시물의 저작권)",
    title: "제11조 (게시물의 저작권)",
    description: `
  빅스텝이 서비스 내 게시한 게시물의 저작권은 빅스텝에 귀속됩니다.
  회원이 서비스 내 게시한 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다.
  회원이 서비스 내에 게시하는 게시물은 서비스 및 관련 프로모션 또는 상품 등의 연구개발, 판촉, 홍보 등의 목적으로 빅스텝이 제공하는 다른 서비스 및 제휴한 타사에 노출될 수 있으며, 해당 노출을 위해 필요한 범위 내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 빅스텝은 「저작권법」 규정을 준수하며, 회원은 언제든지 빅스텝에게 해당 게시물에 대해 삭제, 비공개 등의 조치를 요청할 수 있습니다.`,
  },
  {
    id: "제12조 (이용계약 해지)",
    title: "제12조 (이용계약 해지)",
    description: `
  회원은 언제든지 이용계약을 해지할 수 있습니다. 서비스 내 메뉴 등을 통하여 이용계약 해지 신청을 할 수 있습니다.
  회원이 이용계약을 해지하는 경우, 관련법 및 서비스 개인정보처리방침에 따릅니다.
  이용계약 해지로 인해 발생하는 불이익에 대한 책임은 회원 본인이 부담하여야 하며, 이용계약이 종료되면 빅스텝은 회원에게 부가적으로 제공한 각종 무상혜택을 회수할 수 있습니다.
  `,
  },
  {
    id: "제13조 (책임제한)",
    title: "제13조 (책임제한)",
    description: `
  빅스텝은 법령상 허용되는 한도 내에서 서비스와 관련하여 본 약관에 명시되지 않은 어떠한 구체적인 사항에 대한 약정이나 보증을 하지 않습니다.`,
  },
  {
    id: "제14조 (손해배상)",
    title: "제14조 (손해배상)",
    description: `
  이용자가 본 약관의 규정을 위반함으로 인하여 빅스텝에 손해가 발생하게 되는 경우, 본 약관을 위반한 이용자는 빅스텝에 발생하는 손해를 배상하여야 합니다.
  빅스텝은 서비스에 접속 또는 이용과정에서 발생하는 개인적인 손해, 제3자가 불법적으로 서비스 서버에 접속하거나 이용함으로써 발생하는 손해, 제3자가 서비스 서버에 대한 전송 또는 서버로부터의 전송을 방해함으로써 발생하는 손해, 제3자가 악성 프로그램을 유포함으로써 발생하는 손해, 전송된 데이터의 생략, 누락, 파괴 등으로 인한 손해 등에 대하여 책임을 부담하지 않습니다.
  빅스텝은 법률상 허용되는 한도 내에서 간접 손해, 특별 손해, 결과적 손해, 징계적 손해 및 징벌적 손해에 대한 책임을 부담하지 않습니다. 
  `,
  },
  {
    id: "제15조 (약관수정)",
    title: "제15조 (약관수정)",
    description: `
  빅스텝은 서비스의 변경사항 등을 반영하기 위한 목적으로 본 약관이나 고지사항을 수정할 수 있습니다. 본 약관이 변경되는 경우 변경 사항을 서비스 내 게시하며, 변경된 약관은 게시한 날로부터 7일 후부터 효력이 발생합니다.
  변경된 약관을 게시한 날로부터 효력이 발생하는 날까지 이용자의 의견이 접수되지 않으면, 이용자가 변경된 약관에 따라 서비스를 이용하는데 동의하는 것으로 간주합니다.
  이용자가 변경된 약관에 동의하지 않는 경우, 서비스의 제공이 불가능합니다.
  본 약관 또는 서비스와 관련하여서는 대한민국의 법률이 적용됩니다.
  이 약관은 <2024.4.1>부터 시행됩니다.`,
  },
];

export const privacyPolicy = [
  {
    id: 6430584,
    title: "개인정보 처리방침",
    description:
      "#오챌완은 이용자의 개인정보를 처리함에 있어... Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure repellendus officia non blanditiis earum. Nulla ullam mollitia enim provident optio ipsa dolor sunt quo nihil molestias animi illum, aut suscipit",
  },
  {
    id: 894012,
    title: "개인정보 처리방침2",
    description:
      "#오챌완은 이용자의 개인정보를 처리함에 있어... Lorem ipsum dolor sit amet consectetur adipisicing elit. Iure repellendus officia non blanditiis earum. Nulla ullam mollitia enim provident optio ipsa dolor sunt quo nihil molestias animi illum, aut suscipit",
  },
];
